require 'sinatra'
require "rhymer"


get '/rhyme' do
  rhymer = Rhymer::Parser.new("突然変異と品種改良[編集] 「サクラの一覧」も参照 サクラは突然
変異が多い植物として知られており、花弁や雄蕊の変化、花の大きさ、色の変化、実の増減などが多>分に見られる。品種改良も多く行われ、また変化させるだけでなく、代を重ねることや接木によって>、突然変異を固定化することも行われる。一方で、自家不和合性を持つものも多いため一代限りの突>然変異も稀ではない。自家不和合性を持つ場合、次の代には同じ特徴が受け継がれないことが多いた>めである。  日本では主に花を変化させるために多くの努力が払われたのに対し、西欧では実をより>有用な食品にするため、実を大きく、収穫量が多くなるような品種改良がおこなわれてきた。花が多>かったり八重で豪勢であるなどの見栄えのよいものや花の変わったものに限らず、虫害への強さ、樹>形、木の高さ、寒さや暖かさへの強さなども考慮された園芸品種が存在し、作られている。  桜の花>は日本人に非常に親しまれ、多くの園芸品種が作られてきた。エドヒガンやヤマザクラ、オオシマザ>クラなどは比較的に変性を起こしやすい種であり、園芸技術の発達に伴ってこれらを用いた品種改良>が多く行われた。ソメイヨシノは代表的である。のみならず、野生種、自生種だけで100種程度のサク
ラが存在し、各々の野生、自生種の特徴を継がせながらの配合も行われている。現在、固有種・交配>種を含め600種以上の品種が存在するとされる[5]。園芸種をサトザクラとまとめて分類することもあ>る。  遺伝子情報[編集] 既に植えられている株の品種を、観察から正確に同定するのは難しいが、現
代では遺伝子からたどることが可能となった。人間が作った園芸品種をまとめてサトザクラと呼ぶこ>とがある。八重咲きの品種はヤエザクラと総称される。  Prunus lannesiana Prunus lannesiana var. speciosa Prunus jamasakura Prunus sargentii Prunus verecunda Prunus ×sieboldii Prunus apetala var. pilosa Prunus incisa var. incisa Prunus ×parvifolia Prunus ×furuseana Prunus ×syodoi Prunus ×tajimensis Prunus ×subhirtella Prunus pendula Prunus ×sacra Prunus ×yedoensis Prunus (hybrids between two or more species) Prunus campanulata Prunus ×kanzakura Prunus ×introrsa Prunus ×miyoshii Prunus ×takenakae Prunus incisa var. kinkiensis [8][9] [10] [11]  >生態[編集]  ソメイヨシノの紅葉 日本では、ほぼ全土で何らかの種類が生育可能である。さまざまな
自然環境に合わせて多様な種類が生まれており、日本においてもいくつかの固有種が見られる。たと>えばソメイヨシノの片親であるオオシマザクラは伊豆大島など、南部暖帯に自生する固有種とされる>。日本では少なくとも数百万年前から自生しているとされ、鮮新世の地層とされる三朝層群からムカ>シヤマザクラの葉の化石が見つかっている[12]。  全てではないが、多くの種に共通して見られる特>徴を挙げる。雌雄同株であり、中高木から低木程度の大きさである。樹皮はカバノキにも似た水平方>向の皮目が出来る。葉の形は楕円形であり、枝に互生し、葉の端はぎざぎざ(鋸歯)になっている。葉>に薄い細毛が生えるものも少なくない。葉は秋になると紅葉する。根から新たな茎(ひこばえ)がしば>しば生え、不定根も良く発生する。  サクラは木を傷つけるとそこから腐りやすい性質を持つ。昔は>剪定した部分の消毒も難しかったため、「桜切る馬鹿、梅切らぬ馬鹿」という諺もある。このため、>花見の宴会でサクラの木を折る観光客の被害によってサクラが弱ってしまうこともある。しかし適切>な剪定は可能である。本来、特に自生種は病害にも害虫にもそれほど弱くはないが、人為的に集中し>て植えられている場合や人工的に作られた品種はこれらに弱くなる場合もある。  古木として知られ>る桜も多い。日本三大桜がいずれも樹齢千年を超える老古木となっているほか、五大桜も古木が多く>、内神代桜は樹齢が1800年を超えているとされる。それ以外にも有名で長寿の一本桜が多く存在する[13]。  花[編集]  サクラの蕾 花を観賞する園芸品種として好まれたため、さまざまな姿の花が見ら>れる。花びらは五枚から百数十枚までさまざまであり、多くのものが白から桃色である。サクラに限>らないが用語を挙げる。花弁が五枚までのものを一重、五枚から十枚のものを半八重、十枚以上の花>弁をもつものを八重と言う。また、花弁が非常に多く、一枚一枚が細長い場合、菊咲きと称する。さ>らに萼、花弁、雄蕊の中にさらに萼、花弁、雄蕊のある二重構造のものも見られ、これは段咲きと呼>ばれる。花弁の枚数の増え方には雄蕊が花弁に変化するものと、花弁や雄蕊そのものが倍数加する変>化が見られる[14]。同じサクラ属のモモやウメは花柄が短く枝に付くように咲くが、サクラはこれら>と違って長い花柄をもっており、枝からはなれて咲く。  開花期間は、ソメイヨシノでは、満開から>一週間程度で花が散る。またソメイヨシノはクローンであるために、株ごとのばらつきも小さく、一>斉に咲く。しかし、ソメイヨシノが爆発的に植えられる以前の日本では、少しずつ別の株、別の種に>移りながら、様々な桜が咲くというのが、普通の姿であった。温度や雨が散る散らないの原因になる>。花が咲いた後に気温が下がる花冷えが起こると、花は長く持ち、花が盛りになった後に雨が降ると>早く散る。  ソメイヨシノなどで良く知られている通り、葉が展開する前に花が咲くものも少くない>。花が散り頃に葉が混ざって生えた状態から初夏過ぎまでを葉桜と呼ぶ。  開花期は種により、また>地域によるばらつきも大きい。日本においては1月、沖縄のカンヒザクラを皮切りに、カンザクラ、次
いでヤマザクラ、ソメイヨシノ、ヤエザクラ、カスミザクラは5月上旬くらいまで花を咲かす。")
  body = ''
  r = rhymer.rhymes.sample
  body << [r[0], r[1]].join(" ")
  headers \
    "Content-Type" => "text/html;charset=utf8"
  body
end
